{"config": {"input_layers": [["input_1", 0, 0]], "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 16, 32, 3], "input_dtype": "float32", "name": "input_1", "sparse": false}, "inbound_nodes": []}, {"name": "convolution2d_2", "class_name": "Convolution2D", "config": {"nb_filter": 32, "W_constraint": null, "bias": true, "activity_regularizer": null, "border_mode": "valid", "dim_ordering": "tf", "W_regularizer": null, "trainable": true, "b_regularizer": null, "activation": "relu", "subsample": [1, 1], "nb_row": 3, "nb_col": 3, "name": "convolution2d_2", "init": "glorot_uniform", "b_constraint": null}, "inbound_nodes": [[["input_1", 0, 0]]]}, {"name": "maxpooling2d_1", "class_name": "MaxPooling2D", "config": {"pool_size": [4, 4], "border_mode": "valid", "dim_ordering": "tf", "strides": [4, 4], "trainable": true, "name": "maxpooling2d_1"}, "inbound_nodes": [[["convolution2d_2", 0, 0]]]}, {"name": "dropout_2", "class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.5}, "inbound_nodes": [[["maxpooling2d_1", 0, 0]]]}, {"name": "flatten_1", "class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}, "inbound_nodes": [[["dropout_2", 0, 0]]]}, {"name": "dense_1", "class_name": "Dense", "config": {"W_constraint": null, "b_regularizer": null, "b_constraint": null, "activity_regularizer": null, "W_regularizer": null, "output_dim": 1, "trainable": true, "bias": true, "activation": "linear", "input_dim": null, "name": "dense_1", "init": "glorot_uniform"}, "inbound_nodes": [[["flatten_1", 0, 0]]]}], "name": "model_1", "output_layers": [["dense_1", 0, 0]]}, "class_name": "Model", "keras_version": "1.1.2"}