{"keras_version": "1.1.2", "config": {"layers": [{"inbound_nodes": [], "config": {"batch_input_shape": [null, 16, 32, 3], "input_dtype": "float32", "sparse": false, "name": "input_1"}, "class_name": "InputLayer", "name": "input_1"}, {"inbound_nodes": [[["input_1", 0, 0]]], "config": {"init": "glorot_uniform", "border_mode": "valid", "b_constraint": null, "name": "convolution2d_2", "nb_row": 3, "W_constraint": null, "trainable": true, "b_regularizer": null, "activity_regularizer": null, "nb_filter": 32, "activation": "relu", "subsample": [1, 1], "nb_col": 3, "W_regularizer": null, "dim_ordering": "tf", "bias": true}, "class_name": "Convolution2D", "name": "convolution2d_2"}, {"inbound_nodes": [[["convolution2d_2", 0, 0]]], "config": {"border_mode": "valid", "pool_size": [4, 4], "name": "maxpooling2d_1", "strides": [4, 4], "trainable": true, "dim_ordering": "tf"}, "class_name": "MaxPooling2D", "name": "maxpooling2d_1"}, {"inbound_nodes": [[["maxpooling2d_1", 0, 0]]], "config": {"p": 0.5, "trainable": true, "name": "dropout_2"}, "class_name": "Dropout", "name": "dropout_2"}, {"inbound_nodes": [[["dropout_2", 0, 0]]], "config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten", "name": "flatten_1"}, {"inbound_nodes": [[["flatten_1", 0, 0]]], "config": {"b_constraint": null, "output_dim": 1, "name": "dense_1", "W_constraint": null, "trainable": true, "b_regularizer": null, "activity_regularizer": null, "input_dim": null, "activation": "linear", "init": "glorot_uniform", "W_regularizer": null, "bias": true}, "class_name": "Dense", "name": "dense_1"}], "output_layers": [["dense_1", 0, 0]], "input_layers": [["input_1", 0, 0]], "name": "model_1"}, "class_name": "Model"}