{"config": {"input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["dense_4", 0, 0]], "layers": [{"config": {"name": "input_1", "input_dtype": "float32", "batch_input_shape": [null, 66, 200, 3], "sparse": false}, "name": "input_1", "class_name": "InputLayer", "inbound_nodes": []}, {"config": {"name": "lambda_1", "output_shape_type": "raw", "arguments": {}, "trainable": true, "function_type": "lambda", "output_shape": null, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001zr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa]C:/Users/minotauro/Google Drive/GITHUB/self-driving-car/project_3_behavioral_cloning/model.py\u00da\b<lambda>\u001b\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null]}, "name": "lambda_1", "class_name": "Lambda", "inbound_nodes": [[["input_1", 0, 0]]]}, {"config": {"name": "convolution2d_1", "nb_row": 5, "border_mode": "valid", "bias": true, "b_constraint": null, "W_regularizer": null, "b_regularizer": null, "activation": "linear", "subsample": [2, 2], "nb_col": 5, "activity_regularizer": null, "nb_filter": 24, "trainable": true, "init": "he_normal", "dim_ordering": "tf", "W_constraint": null}, "name": "convolution2d_1", "class_name": "Convolution2D", "inbound_nodes": [[["lambda_1", 0, 0]]]}, {"config": {"trainable": true, "name": "elu_1", "alpha": 1.0}, "name": "elu_1", "class_name": "ELU", "inbound_nodes": [[["convolution2d_1", 0, 0]]]}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.2}, "name": "dropout_1", "class_name": "Dropout", "inbound_nodes": [[["elu_1", 0, 0]]]}, {"config": {"name": "convolution2d_2", "nb_row": 5, "border_mode": "valid", "bias": true, "b_constraint": null, "W_regularizer": null, "b_regularizer": null, "activation": "linear", "subsample": [2, 2], "nb_col": 5, "activity_regularizer": null, "nb_filter": 36, "trainable": true, "init": "he_normal", "dim_ordering": "tf", "W_constraint": null}, "name": "convolution2d_2", "class_name": "Convolution2D", "inbound_nodes": [[["dropout_1", 0, 0]]]}, {"config": {"trainable": true, "name": "elu_2", "alpha": 1.0}, "name": "elu_2", "class_name": "ELU", "inbound_nodes": [[["convolution2d_2", 0, 0]]]}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.2}, "name": "dropout_2", "class_name": "Dropout", "inbound_nodes": [[["elu_2", 0, 0]]]}, {"config": {"name": "convolution2d_3", "nb_row": 5, "border_mode": "valid", "bias": true, "b_constraint": null, "W_regularizer": null, "b_regularizer": null, "activation": "linear", "subsample": [2, 2], "nb_col": 5, "activity_regularizer": null, "nb_filter": 48, "trainable": true, "init": "he_normal", "dim_ordering": "tf", "W_constraint": null}, "name": "convolution2d_3", "class_name": "Convolution2D", "inbound_nodes": [[["dropout_2", 0, 0]]]}, {"config": {"trainable": true, "name": "elu_3", "alpha": 1.0}, "name": "elu_3", "class_name": "ELU", "inbound_nodes": [[["convolution2d_3", 0, 0]]]}, {"config": {"trainable": true, "name": "dropout_3", "p": 0.2}, "name": "dropout_3", "class_name": "Dropout", "inbound_nodes": [[["elu_3", 0, 0]]]}, {"config": {"name": "convolution2d_4", "nb_row": 3, "border_mode": "valid", "bias": true, "b_constraint": null, "W_regularizer": null, "b_regularizer": null, "activation": "linear", "subsample": [1, 1], "nb_col": 3, "activity_regularizer": null, "nb_filter": 64, "trainable": true, "init": "he_normal", "dim_ordering": "tf", "W_constraint": null}, "name": "convolution2d_4", "class_name": "Convolution2D", "inbound_nodes": [[["dropout_3", 0, 0]]]}, {"config": {"trainable": true, "name": "elu_4", "alpha": 1.0}, "name": "elu_4", "class_name": "ELU", "inbound_nodes": [[["convolution2d_4", 0, 0]]]}, {"config": {"trainable": true, "name": "dropout_4", "p": 0.2}, "name": "dropout_4", "class_name": "Dropout", "inbound_nodes": [[["elu_4", 0, 0]]]}, {"config": {"name": "convolution2d_5", "nb_row": 3, "border_mode": "valid", "bias": true, "b_constraint": null, "W_regularizer": null, "b_regularizer": null, "activation": "linear", "subsample": [1, 1], "nb_col": 3, "activity_regularizer": null, "nb_filter": 64, "trainable": true, "init": "he_normal", "dim_ordering": "tf", "W_constraint": null}, "name": "convolution2d_5", "class_name": "Convolution2D", "inbound_nodes": [[["dropout_4", 0, 0]]]}, {"config": {"trainable": true, "name": "elu_5", "alpha": 1.0}, "name": "elu_5", "class_name": "ELU", "inbound_nodes": [[["convolution2d_5", 0, 0]]]}, {"config": {"trainable": true, "name": "dropout_5", "p": 0.2}, "name": "dropout_5", "class_name": "Dropout", "inbound_nodes": [[["elu_5", 0, 0]]]}, {"config": {"trainable": true, "name": "flatten_1"}, "name": "flatten_1", "class_name": "Flatten", "inbound_nodes": [[["dropout_5", 0, 0]]]}, {"config": {"name": "dense_1", "activity_regularizer": null, "bias": true, "b_constraint": null, "b_regularizer": null, "activation": "linear", "W_regularizer": null, "input_dim": null, "output_dim": 100, "trainable": true, "init": "he_normal", "W_constraint": null}, "name": "dense_1", "class_name": "Dense", "inbound_nodes": [[["flatten_1", 0, 0]]]}, {"config": {"trainable": true, "name": "elu_6", "alpha": 1.0}, "name": "elu_6", "class_name": "ELU", "inbound_nodes": [[["dense_1", 0, 0]]]}, {"config": {"trainable": true, "name": "dropout_6", "p": 0.5}, "name": "dropout_6", "class_name": "Dropout", "inbound_nodes": [[["elu_6", 0, 0]]]}, {"config": {"name": "dense_2", "activity_regularizer": null, "bias": true, "b_constraint": null, "b_regularizer": null, "activation": "linear", "W_regularizer": null, "input_dim": null, "output_dim": 50, "trainable": true, "init": "he_normal", "W_constraint": null}, "name": "dense_2", "class_name": "Dense", "inbound_nodes": [[["dropout_6", 0, 0]]]}, {"config": {"trainable": true, "name": "elu_7", "alpha": 1.0}, "name": "elu_7", "class_name": "ELU", "inbound_nodes": [[["dense_2", 0, 0]]]}, {"config": {"trainable": true, "name": "dropout_7", "p": 0.5}, "name": "dropout_7", "class_name": "Dropout", "inbound_nodes": [[["elu_7", 0, 0]]]}, {"config": {"name": "dense_3", "activity_regularizer": null, "bias": true, "b_constraint": null, "b_regularizer": null, "activation": "linear", "W_regularizer": null, "input_dim": null, "output_dim": 10, "trainable": true, "init": "he_normal", "W_constraint": null}, "name": "dense_3", "class_name": "Dense", "inbound_nodes": [[["dropout_7", 0, 0]]]}, {"config": {"trainable": true, "name": "elu_8", "alpha": 1.0}, "name": "elu_8", "class_name": "ELU", "inbound_nodes": [[["dense_3", 0, 0]]]}, {"config": {"name": "dense_4", "activity_regularizer": null, "bias": true, "b_constraint": null, "b_regularizer": null, "activation": "linear", "W_regularizer": null, "input_dim": null, "output_dim": 1, "trainable": true, "init": "he_normal", "W_constraint": null}, "name": "dense_4", "class_name": "Dense", "inbound_nodes": [[["elu_8", 0, 0]]]}]}, "class_name": "Model", "keras_version": "1.1.2"}