{"class_name": "Model", "keras_version": "1.1.2", "config": {"input_layers": [["input_1", 0, 0]], "name": "model_1", "layers": [{"class_name": "InputLayer", "name": "input_1", "inbound_nodes": [], "config": {"name": "input_1", "sparse": false, "batch_input_shape": [null, 66, 200, 3], "input_dtype": "float32"}}, {"class_name": "Lambda", "name": "lambda_1", "inbound_nodes": [[["input_1", 0, 0]]], "config": {"output_shape_type": "raw", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001zr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa]C:/Users/minotauro/Google Drive/GITHUB/self-driving-car/project_3_behavioral_cloning/model.py\u00da\b<lambda>\u001c\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda", "trainable": true, "name": "lambda_1", "arguments": {}, "output_shape": null}}, {"class_name": "Convolution2D", "name": "convolution2d_1", "inbound_nodes": [[["lambda_1", 0, 0]]], "config": {"nb_filter": 24, "trainable": true, "activation": "linear", "dim_ordering": "tf", "border_mode": "valid", "name": "convolution2d_1", "W_constraint": null, "b_regularizer": null, "subsample": [2, 2], "nb_col": 5, "activity_regularizer": null, "nb_row": 5, "b_constraint": null, "bias": true, "W_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "ELU", "name": "elu_1", "inbound_nodes": [[["convolution2d_1", 0, 0]]], "config": {"name": "elu_1", "trainable": true, "alpha": 1.0}}, {"class_name": "Dropout", "name": "dropout_1", "inbound_nodes": [[["elu_1", 0, 0]]], "config": {"name": "dropout_1", "trainable": true, "p": 0.2}}, {"class_name": "Convolution2D", "name": "convolution2d_2", "inbound_nodes": [[["dropout_1", 0, 0]]], "config": {"nb_filter": 36, "trainable": true, "activation": "linear", "dim_ordering": "tf", "border_mode": "valid", "name": "convolution2d_2", "W_constraint": null, "b_regularizer": null, "subsample": [2, 2], "nb_col": 5, "activity_regularizer": null, "nb_row": 5, "b_constraint": null, "bias": true, "W_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "ELU", "name": "elu_2", "inbound_nodes": [[["convolution2d_2", 0, 0]]], "config": {"name": "elu_2", "trainable": true, "alpha": 1.0}}, {"class_name": "Dropout", "name": "dropout_2", "inbound_nodes": [[["elu_2", 0, 0]]], "config": {"name": "dropout_2", "trainable": true, "p": 0.2}}, {"class_name": "Convolution2D", "name": "convolution2d_3", "inbound_nodes": [[["dropout_2", 0, 0]]], "config": {"nb_filter": 48, "trainable": true, "activation": "linear", "dim_ordering": "tf", "border_mode": "valid", "name": "convolution2d_3", "W_constraint": null, "b_regularizer": null, "subsample": [2, 2], "nb_col": 5, "activity_regularizer": null, "nb_row": 5, "b_constraint": null, "bias": true, "W_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "ELU", "name": "elu_3", "inbound_nodes": [[["convolution2d_3", 0, 0]]], "config": {"name": "elu_3", "trainable": true, "alpha": 1.0}}, {"class_name": "Dropout", "name": "dropout_3", "inbound_nodes": [[["elu_3", 0, 0]]], "config": {"name": "dropout_3", "trainable": true, "p": 0.2}}, {"class_name": "Convolution2D", "name": "convolution2d_4", "inbound_nodes": [[["dropout_3", 0, 0]]], "config": {"nb_filter": 64, "trainable": true, "activation": "linear", "dim_ordering": "tf", "border_mode": "valid", "name": "convolution2d_4", "W_constraint": null, "b_regularizer": null, "subsample": [1, 1], "nb_col": 3, "activity_regularizer": null, "nb_row": 3, "b_constraint": null, "bias": true, "W_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "ELU", "name": "elu_4", "inbound_nodes": [[["convolution2d_4", 0, 0]]], "config": {"name": "elu_4", "trainable": true, "alpha": 1.0}}, {"class_name": "Dropout", "name": "dropout_4", "inbound_nodes": [[["elu_4", 0, 0]]], "config": {"name": "dropout_4", "trainable": true, "p": 0.2}}, {"class_name": "Convolution2D", "name": "convolution2d_5", "inbound_nodes": [[["dropout_4", 0, 0]]], "config": {"nb_filter": 64, "trainable": true, "activation": "linear", "dim_ordering": "tf", "border_mode": "valid", "name": "convolution2d_5", "W_constraint": null, "b_regularizer": null, "subsample": [1, 1], "nb_col": 3, "activity_regularizer": null, "nb_row": 3, "b_constraint": null, "bias": true, "W_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "ELU", "name": "elu_5", "inbound_nodes": [[["convolution2d_5", 0, 0]]], "config": {"name": "elu_5", "trainable": true, "alpha": 1.0}}, {"class_name": "Dropout", "name": "dropout_5", "inbound_nodes": [[["elu_5", 0, 0]]], "config": {"name": "dropout_5", "trainable": true, "p": 0.2}}, {"class_name": "Flatten", "name": "flatten_1", "inbound_nodes": [[["dropout_5", 0, 0]]], "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "name": "dense_1", "inbound_nodes": [[["flatten_1", 0, 0]]], "config": {"trainable": true, "activation": "linear", "bias": true, "activity_regularizer": null, "W_constraint": null, "b_regularizer": null, "name": "dense_1", "output_dim": 100, "b_constraint": null, "input_dim": null, "W_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "ELU", "name": "elu_6", "inbound_nodes": [[["dense_1", 0, 0]]], "config": {"name": "elu_6", "trainable": true, "alpha": 1.0}}, {"class_name": "Dropout", "name": "dropout_6", "inbound_nodes": [[["elu_6", 0, 0]]], "config": {"name": "dropout_6", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "name": "dense_2", "inbound_nodes": [[["dropout_6", 0, 0]]], "config": {"trainable": true, "activation": "linear", "bias": true, "activity_regularizer": null, "W_constraint": null, "b_regularizer": null, "name": "dense_2", "output_dim": 50, "b_constraint": null, "input_dim": null, "W_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "ELU", "name": "elu_7", "inbound_nodes": [[["dense_2", 0, 0]]], "config": {"name": "elu_7", "trainable": true, "alpha": 1.0}}, {"class_name": "Dropout", "name": "dropout_7", "inbound_nodes": [[["elu_7", 0, 0]]], "config": {"name": "dropout_7", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "name": "dense_3", "inbound_nodes": [[["dropout_7", 0, 0]]], "config": {"trainable": true, "activation": "linear", "bias": true, "activity_regularizer": null, "W_constraint": null, "b_regularizer": null, "name": "dense_3", "output_dim": 10, "b_constraint": null, "input_dim": null, "W_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "ELU", "name": "elu_8", "inbound_nodes": [[["dense_3", 0, 0]]], "config": {"name": "elu_8", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "name": "dense_4", "inbound_nodes": [[["elu_8", 0, 0]]], "config": {"trainable": true, "activation": "linear", "bias": true, "activity_regularizer": null, "W_constraint": null, "b_regularizer": null, "name": "dense_4", "output_dim": 1, "b_constraint": null, "input_dim": null, "W_regularizer": null, "init": "glorot_uniform"}}], "output_layers": [["dense_4", 0, 0]]}}