{"keras_version": "1.1.2", "class_name": "Model", "config": {"output_layers": [["dense_4", 0, 0]], "name": "model_1", "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "input_1", "config": {"batch_input_shape": [null, 66, 200, 3], "sparse": false, "input_dtype": "float32", "name": "input_1"}}, {"inbound_nodes": [[["input_1", 0, 0]]], "class_name": "Lambda", "name": "lambda_1", "config": {"function_type": "lambda", "trainable": true, "arguments": {}, "name": "lambda_1", "output_shape_type": "raw", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001zr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa]C:/Users/minotauro/Google Drive/GITHUB/self-driving-car/project_3_behavioral_cloning/model.py\u00da\b<lambda>\u0014\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape": null}}, {"inbound_nodes": [[["lambda_1", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_1", "config": {"border_mode": "valid", "name": "convolution2d_1", "bias": true, "b_constraint": null, "nb_col": 5, "init": "glorot_uniform", "nb_row": 5, "W_constraint": null, "dim_ordering": "tf", "trainable": true, "nb_filter": 24, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "subsample": [2, 2], "activity_regularizer": null}}, {"inbound_nodes": [[["convolution2d_1", 0, 0]]], "class_name": "ELU", "name": "elu_1", "config": {"trainable": true, "name": "elu_1", "alpha": 1.0}}, {"inbound_nodes": [[["elu_1", 0, 0]]], "class_name": "Dropout", "name": "dropout_1", "config": {"trainable": true, "name": "dropout_1", "p": 0.2}}, {"inbound_nodes": [[["dropout_1", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_2", "config": {"border_mode": "valid", "name": "convolution2d_2", "bias": true, "b_constraint": null, "nb_col": 5, "init": "glorot_uniform", "nb_row": 5, "W_constraint": null, "dim_ordering": "tf", "trainable": true, "nb_filter": 36, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "subsample": [2, 2], "activity_regularizer": null}}, {"inbound_nodes": [[["convolution2d_2", 0, 0]]], "class_name": "ELU", "name": "elu_2", "config": {"trainable": true, "name": "elu_2", "alpha": 1.0}}, {"inbound_nodes": [[["elu_2", 0, 0]]], "class_name": "Dropout", "name": "dropout_2", "config": {"trainable": true, "name": "dropout_2", "p": 0.2}}, {"inbound_nodes": [[["dropout_2", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_3", "config": {"border_mode": "valid", "name": "convolution2d_3", "bias": true, "b_constraint": null, "nb_col": 5, "init": "glorot_uniform", "nb_row": 5, "W_constraint": null, "dim_ordering": "tf", "trainable": true, "nb_filter": 48, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "subsample": [2, 2], "activity_regularizer": null}}, {"inbound_nodes": [[["convolution2d_3", 0, 0]]], "class_name": "ELU", "name": "elu_3", "config": {"trainable": true, "name": "elu_3", "alpha": 1.0}}, {"inbound_nodes": [[["elu_3", 0, 0]]], "class_name": "Dropout", "name": "dropout_3", "config": {"trainable": true, "name": "dropout_3", "p": 0.2}}, {"inbound_nodes": [[["dropout_3", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_4", "config": {"border_mode": "valid", "name": "convolution2d_4", "bias": true, "b_constraint": null, "nb_col": 3, "init": "glorot_uniform", "nb_row": 3, "W_constraint": null, "dim_ordering": "tf", "trainable": true, "nb_filter": 64, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "subsample": [1, 1], "activity_regularizer": null}}, {"inbound_nodes": [[["convolution2d_4", 0, 0]]], "class_name": "ELU", "name": "elu_4", "config": {"trainable": true, "name": "elu_4", "alpha": 1.0}}, {"inbound_nodes": [[["elu_4", 0, 0]]], "class_name": "Dropout", "name": "dropout_4", "config": {"trainable": true, "name": "dropout_4", "p": 0.2}}, {"inbound_nodes": [[["dropout_4", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_5", "config": {"border_mode": "valid", "name": "convolution2d_5", "bias": true, "b_constraint": null, "nb_col": 3, "init": "glorot_uniform", "nb_row": 3, "W_constraint": null, "dim_ordering": "tf", "trainable": true, "nb_filter": 64, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "subsample": [1, 1], "activity_regularizer": null}}, {"inbound_nodes": [[["convolution2d_5", 0, 0]]], "class_name": "ELU", "name": "elu_5", "config": {"trainable": true, "name": "elu_5", "alpha": 1.0}}, {"inbound_nodes": [[["elu_5", 0, 0]]], "class_name": "Dropout", "name": "dropout_5", "config": {"trainable": true, "name": "dropout_5", "p": 0.2}}, {"inbound_nodes": [[["dropout_5", 0, 0]]], "class_name": "Flatten", "name": "flatten_1", "config": {"name": "flatten_1", "trainable": true}}, {"inbound_nodes": [[["flatten_1", 0, 0]]], "class_name": "Dense", "name": "dense_1", "config": {"output_dim": 100, "name": "dense_1", "bias": true, "input_dim": null, "activation": "linear", "b_constraint": null, "W_constraint": null, "trainable": true, "activity_regularizer": null, "b_regularizer": null, "W_regularizer": null, "init": "glorot_uniform"}}, {"inbound_nodes": [[["dense_1", 0, 0]]], "class_name": "ELU", "name": "elu_6", "config": {"trainable": true, "name": "elu_6", "alpha": 1.0}}, {"inbound_nodes": [[["elu_6", 0, 0]]], "class_name": "Dropout", "name": "dropout_6", "config": {"trainable": true, "name": "dropout_6", "p": 0.5}}, {"inbound_nodes": [[["dropout_6", 0, 0]]], "class_name": "Dense", "name": "dense_2", "config": {"output_dim": 50, "name": "dense_2", "bias": true, "input_dim": null, "activation": "linear", "b_constraint": null, "W_constraint": null, "trainable": true, "activity_regularizer": null, "b_regularizer": null, "W_regularizer": null, "init": "glorot_uniform"}}, {"inbound_nodes": [[["dense_2", 0, 0]]], "class_name": "ELU", "name": "elu_7", "config": {"trainable": true, "name": "elu_7", "alpha": 1.0}}, {"inbound_nodes": [[["elu_7", 0, 0]]], "class_name": "Dropout", "name": "dropout_7", "config": {"trainable": true, "name": "dropout_7", "p": 0.5}}, {"inbound_nodes": [[["dropout_7", 0, 0]]], "class_name": "Dense", "name": "dense_3", "config": {"output_dim": 10, "name": "dense_3", "bias": true, "input_dim": null, "activation": "linear", "b_constraint": null, "W_constraint": null, "trainable": true, "activity_regularizer": null, "b_regularizer": null, "W_regularizer": null, "init": "glorot_uniform"}}, {"inbound_nodes": [[["dense_3", 0, 0]]], "class_name": "ELU", "name": "elu_8", "config": {"trainable": true, "name": "elu_8", "alpha": 1.0}}, {"inbound_nodes": [[["elu_8", 0, 0]]], "class_name": "Dense", "name": "dense_4", "config": {"output_dim": 1, "name": "dense_4", "bias": true, "input_dim": null, "activation": "linear", "b_constraint": null, "W_constraint": null, "trainable": true, "activity_regularizer": null, "b_regularizer": null, "W_regularizer": null, "init": "glorot_uniform"}}], "input_layers": [["input_1", 0, 0]]}}