{"config": {"name": "model_1", "output_layers": [["dense_4", 0, 0]], "input_layers": [["input_1", 0, 0]], "layers": [{"name": "input_1", "config": {"name": "input_1", "input_dtype": "float32", "batch_input_shape": [null, 66, 200, 3], "sparse": false}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "convolution2d_1", "config": {"name": "convolution2d_1", "init": "glorot_uniform", "nb_filter": 24, "b_constraint": null, "nb_col": 5, "activity_regularizer": null, "trainable": true, "W_constraint": null, "dim_ordering": "tf", "activation": "linear", "W_regularizer": null, "border_mode": "valid", "subsample": [2, 2], "bias": true, "b_regularizer": null, "nb_row": 5}, "inbound_nodes": [[["input_1", 0, 0]]], "class_name": "Convolution2D"}, {"name": "elu_1", "config": {"name": "elu_1", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["convolution2d_1", 0, 0]]], "class_name": "ELU"}, {"name": "dropout_1", "config": {"name": "dropout_1", "p": 0.2, "trainable": true}, "inbound_nodes": [[["elu_1", 0, 0]]], "class_name": "Dropout"}, {"name": "convolution2d_2", "config": {"name": "convolution2d_2", "init": "glorot_uniform", "nb_filter": 36, "b_constraint": null, "nb_col": 5, "activity_regularizer": null, "trainable": true, "W_constraint": null, "dim_ordering": "tf", "activation": "linear", "W_regularizer": null, "border_mode": "valid", "subsample": [2, 2], "bias": true, "b_regularizer": null, "nb_row": 5}, "inbound_nodes": [[["dropout_1", 0, 0]]], "class_name": "Convolution2D"}, {"name": "elu_2", "config": {"name": "elu_2", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["convolution2d_2", 0, 0]]], "class_name": "ELU"}, {"name": "dropout_2", "config": {"name": "dropout_2", "p": 0.2, "trainable": true}, "inbound_nodes": [[["elu_2", 0, 0]]], "class_name": "Dropout"}, {"name": "convolution2d_3", "config": {"name": "convolution2d_3", "init": "glorot_uniform", "nb_filter": 48, "b_constraint": null, "nb_col": 5, "activity_regularizer": null, "trainable": true, "W_constraint": null, "dim_ordering": "tf", "activation": "linear", "W_regularizer": null, "border_mode": "valid", "subsample": [2, 2], "bias": true, "b_regularizer": null, "nb_row": 5}, "inbound_nodes": [[["dropout_2", 0, 0]]], "class_name": "Convolution2D"}, {"name": "elu_3", "config": {"name": "elu_3", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["convolution2d_3", 0, 0]]], "class_name": "ELU"}, {"name": "dropout_3", "config": {"name": "dropout_3", "p": 0.2, "trainable": true}, "inbound_nodes": [[["elu_3", 0, 0]]], "class_name": "Dropout"}, {"name": "convolution2d_4", "config": {"name": "convolution2d_4", "init": "glorot_uniform", "nb_filter": 64, "b_constraint": null, "nb_col": 3, "activity_regularizer": null, "trainable": true, "W_constraint": null, "dim_ordering": "tf", "activation": "linear", "W_regularizer": null, "border_mode": "valid", "subsample": [1, 1], "bias": true, "b_regularizer": null, "nb_row": 3}, "inbound_nodes": [[["dropout_3", 0, 0]]], "class_name": "Convolution2D"}, {"name": "elu_4", "config": {"name": "elu_4", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["convolution2d_4", 0, 0]]], "class_name": "ELU"}, {"name": "dropout_4", "config": {"name": "dropout_4", "p": 0.2, "trainable": true}, "inbound_nodes": [[["elu_4", 0, 0]]], "class_name": "Dropout"}, {"name": "convolution2d_5", "config": {"name": "convolution2d_5", "init": "glorot_uniform", "nb_filter": 64, "b_constraint": null, "nb_col": 3, "activity_regularizer": null, "trainable": true, "W_constraint": null, "dim_ordering": "tf", "activation": "linear", "W_regularizer": null, "border_mode": "valid", "subsample": [1, 1], "bias": true, "b_regularizer": null, "nb_row": 3}, "inbound_nodes": [[["dropout_4", 0, 0]]], "class_name": "Convolution2D"}, {"name": "elu_5", "config": {"name": "elu_5", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["convolution2d_5", 0, 0]]], "class_name": "ELU"}, {"name": "dropout_5", "config": {"name": "dropout_5", "p": 0.2, "trainable": true}, "inbound_nodes": [[["elu_5", 0, 0]]], "class_name": "Dropout"}, {"name": "flatten_1", "config": {"name": "flatten_1", "trainable": true}, "inbound_nodes": [[["dropout_5", 0, 0]]], "class_name": "Flatten"}, {"name": "dense_1", "config": {"name": "dense_1", "init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "output_dim": 100, "trainable": true, "bias": true, "b_regularizer": null, "activation": "linear", "W_constraint": null, "W_regularizer": null, "input_dim": null}, "inbound_nodes": [[["flatten_1", 0, 0]]], "class_name": "Dense"}, {"name": "elu_6", "config": {"name": "elu_6", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["dense_1", 0, 0]]], "class_name": "ELU"}, {"name": "dropout_6", "config": {"name": "dropout_6", "p": 0.5, "trainable": true}, "inbound_nodes": [[["elu_6", 0, 0]]], "class_name": "Dropout"}, {"name": "dense_2", "config": {"name": "dense_2", "init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "output_dim": 50, "trainable": true, "bias": true, "b_regularizer": null, "activation": "linear", "W_constraint": null, "W_regularizer": null, "input_dim": null}, "inbound_nodes": [[["dropout_6", 0, 0]]], "class_name": "Dense"}, {"name": "elu_7", "config": {"name": "elu_7", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["dense_2", 0, 0]]], "class_name": "ELU"}, {"name": "dropout_7", "config": {"name": "dropout_7", "p": 0.5, "trainable": true}, "inbound_nodes": [[["elu_7", 0, 0]]], "class_name": "Dropout"}, {"name": "dense_3", "config": {"name": "dense_3", "init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "output_dim": 10, "trainable": true, "bias": true, "b_regularizer": null, "activation": "linear", "W_constraint": null, "W_regularizer": null, "input_dim": null}, "inbound_nodes": [[["dropout_7", 0, 0]]], "class_name": "Dense"}, {"name": "elu_8", "config": {"name": "elu_8", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["dense_3", 0, 0]]], "class_name": "ELU"}, {"name": "dense_4", "config": {"name": "dense_4", "init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "output_dim": 1, "trainable": true, "bias": true, "b_regularizer": null, "activation": "linear", "W_constraint": null, "W_regularizer": null, "input_dim": null}, "inbound_nodes": [[["elu_8", 0, 0]]], "class_name": "Dense"}]}, "keras_version": "1.1.2", "class_name": "Model"}