{"config": {"input_layers": [["input_1", 0, 0]], "name": "model_1", "layers": [{"config": {"input_dtype": "float32", "sparse": false, "batch_input_shape": [null, 66, 200, 3], "name": "input_1"}, "name": "input_1", "inbound_nodes": [], "class_name": "InputLayer"}, {"config": {"W_constraint": null, "nb_filter": 24, "dim_ordering": "tf", "border_mode": "valid", "nb_col": 5, "trainable": true, "init": "glorot_uniform", "activity_regularizer": null, "nb_row": 5, "bias": true, "activation": "linear", "b_constraint": null, "subsample": [2, 2], "name": "convolution2d_1", "b_regularizer": null, "W_regularizer": null}, "name": "convolution2d_1", "inbound_nodes": [[["input_1", 0, 0]]], "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_1"}, "name": "elu_1", "inbound_nodes": [[["convolution2d_1", 0, 0]]], "class_name": "ELU"}, {"config": {"p": 0.2, "trainable": true, "name": "dropout_1"}, "name": "dropout_1", "inbound_nodes": [[["elu_1", 0, 0]]], "class_name": "Dropout"}, {"config": {"W_constraint": null, "nb_filter": 36, "dim_ordering": "tf", "border_mode": "valid", "nb_col": 5, "trainable": true, "init": "glorot_uniform", "activity_regularizer": null, "nb_row": 5, "bias": true, "activation": "linear", "b_constraint": null, "subsample": [2, 2], "name": "convolution2d_2", "b_regularizer": null, "W_regularizer": null}, "name": "convolution2d_2", "inbound_nodes": [[["dropout_1", 0, 0]]], "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_2"}, "name": "elu_2", "inbound_nodes": [[["convolution2d_2", 0, 0]]], "class_name": "ELU"}, {"config": {"p": 0.2, "trainable": true, "name": "dropout_2"}, "name": "dropout_2", "inbound_nodes": [[["elu_2", 0, 0]]], "class_name": "Dropout"}, {"config": {"W_constraint": null, "nb_filter": 48, "dim_ordering": "tf", "border_mode": "valid", "nb_col": 5, "trainable": true, "init": "glorot_uniform", "activity_regularizer": null, "nb_row": 5, "bias": true, "activation": "linear", "b_constraint": null, "subsample": [2, 2], "name": "convolution2d_3", "b_regularizer": null, "W_regularizer": null}, "name": "convolution2d_3", "inbound_nodes": [[["dropout_2", 0, 0]]], "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_3"}, "name": "elu_3", "inbound_nodes": [[["convolution2d_3", 0, 0]]], "class_name": "ELU"}, {"config": {"p": 0.2, "trainable": true, "name": "dropout_3"}, "name": "dropout_3", "inbound_nodes": [[["elu_3", 0, 0]]], "class_name": "Dropout"}, {"config": {"W_constraint": null, "nb_filter": 64, "dim_ordering": "tf", "border_mode": "valid", "nb_col": 3, "trainable": true, "init": "glorot_uniform", "activity_regularizer": null, "nb_row": 3, "bias": true, "activation": "linear", "b_constraint": null, "subsample": [1, 1], "name": "convolution2d_4", "b_regularizer": null, "W_regularizer": null}, "name": "convolution2d_4", "inbound_nodes": [[["dropout_3", 0, 0]]], "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_4"}, "name": "elu_4", "inbound_nodes": [[["convolution2d_4", 0, 0]]], "class_name": "ELU"}, {"config": {"p": 0.2, "trainable": true, "name": "dropout_4"}, "name": "dropout_4", "inbound_nodes": [[["elu_4", 0, 0]]], "class_name": "Dropout"}, {"config": {"W_constraint": null, "nb_filter": 64, "dim_ordering": "tf", "border_mode": "valid", "nb_col": 3, "trainable": true, "init": "glorot_uniform", "activity_regularizer": null, "nb_row": 3, "bias": true, "activation": "linear", "b_constraint": null, "subsample": [1, 1], "name": "convolution2d_5", "b_regularizer": null, "W_regularizer": null}, "name": "convolution2d_5", "inbound_nodes": [[["dropout_4", 0, 0]]], "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_5"}, "name": "elu_5", "inbound_nodes": [[["convolution2d_5", 0, 0]]], "class_name": "ELU"}, {"config": {"p": 0.2, "trainable": true, "name": "dropout_5"}, "name": "dropout_5", "inbound_nodes": [[["elu_5", 0, 0]]], "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "name": "flatten_1", "inbound_nodes": [[["dropout_5", 0, 0]]], "class_name": "Flatten"}, {"config": {"W_constraint": null, "output_dim": 100, "trainable": true, "init": "glorot_uniform", "input_dim": null, "bias": true, "activity_regularizer": null, "activation": "linear", "b_constraint": null, "name": "dense_1", "b_regularizer": null, "W_regularizer": null}, "name": "dense_1", "inbound_nodes": [[["flatten_1", 0, 0]]], "class_name": "Dense"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_6"}, "name": "elu_6", "inbound_nodes": [[["dense_1", 0, 0]]], "class_name": "ELU"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_6"}, "name": "dropout_6", "inbound_nodes": [[["elu_6", 0, 0]]], "class_name": "Dropout"}, {"config": {"W_constraint": null, "output_dim": 50, "trainable": true, "init": "glorot_uniform", "input_dim": null, "bias": true, "activity_regularizer": null, "activation": "linear", "b_constraint": null, "name": "dense_2", "b_regularizer": null, "W_regularizer": null}, "name": "dense_2", "inbound_nodes": [[["dropout_6", 0, 0]]], "class_name": "Dense"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_7"}, "name": "elu_7", "inbound_nodes": [[["dense_2", 0, 0]]], "class_name": "ELU"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_7"}, "name": "dropout_7", "inbound_nodes": [[["elu_7", 0, 0]]], "class_name": "Dropout"}, {"config": {"W_constraint": null, "output_dim": 10, "trainable": true, "init": "glorot_uniform", "input_dim": null, "bias": true, "activity_regularizer": null, "activation": "linear", "b_constraint": null, "name": "dense_3", "b_regularizer": null, "W_regularizer": null}, "name": "dense_3", "inbound_nodes": [[["dropout_7", 0, 0]]], "class_name": "Dense"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_8"}, "name": "elu_8", "inbound_nodes": [[["dense_3", 0, 0]]], "class_name": "ELU"}, {"config": {"W_constraint": null, "output_dim": 1, "trainable": true, "init": "glorot_uniform", "input_dim": null, "bias": true, "activity_regularizer": null, "activation": "linear", "b_constraint": null, "name": "dense_4", "b_regularizer": null, "W_regularizer": null}, "name": "dense_4", "inbound_nodes": [[["elu_8", 0, 0]]], "class_name": "Dense"}], "output_layers": [["dense_4", 0, 0]]}, "keras_version": "1.1.2", "class_name": "Model"}